In [2]:
def fact(n):
    if n>1:
        return (n*fact(n-1))
    else:
        return n

print("Factorial of 5 is ",fact(5))

Factorial of 5 is  120

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5],['A','B','C','D','E'])

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [4]:
pd.Series(np.random.randint(0,10,10),'A B C D E F G H I J'.split())

A    2
B    4
C    1
D    9
E    7
F    9
G    4
H    8
I    0
J    1
dtype: int32

In [6]:
pd.Series(np.random.randint(0,5,5),'V  W X Y Z'.split())

V    0
W    2
X    0
Y    4
Z    1
dtype: int32

In [7]:
pd.Series(np.random.rand(5),'V W X Y Z'.split())

V    0.686524
W    0.002089
X    0.747403
Y    0.304229
Z    0.671671
dtype: float64

In [8]:
s1=pd.Series([1,2,3,4,5],'A B C D E'.split())
s1

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [9]:
s2=pd.Series([1,2,3,4,5],'B C D E F'.split())
s2

B    1
C    2
D    3
E    4
F    5
dtype: int64

In [10]:
s1+s2

A    NaN
B    3.0
C    5.0
D    7.0
E    9.0
F    NaN
dtype: float64

In [13]:
s1=pd.Series(np.random.randint(0,5,5),'V  W X Y Z'.split())
s1

V    2
W    4
X    3
Y    4
Z    1
dtype: int32

In [12]:
s2=pd.Series(np.random.rand(5),'U W X Y Z'.split())
s2

U    0.057562
W    0.688581
X    0.279115
Y    0.349457
Z    0.822779
dtype: float64

In [14]:
s1+s2

U         NaN
V         NaN
W    4.688581
X    3.279115
Y    4.349457
Z    1.822779
dtype: float64

In [15]:
s1=pd.Series([0,1,2,3],'A B C D'.split())
s1

A    0
B    1
C    2
D    3
dtype: int64

In [16]:
s2=pd.Series([10,11,12,12],'B C D E'.split())
s2

B    10
C    11
D    12
E    12
dtype: int64

In [20]:
s1+s2

A     NaN
B    11.0
C    13.0
D    15.0
E     NaN
dtype: float64

In [24]:
s3=s1+s2
s3.dropna(inplace=True) #if inplace=False then it wont delete the null values of s3 from s3. s3 will remain the same
s3

B    11.0
C    13.0
D    15.0
dtype: float64

# DataFrames

In [25]:
pd.DataFrame(np.random.randn(5,4))

          0         1         2         3
0 -1.865027 -0.048762 -0.186227 -0.934601
1  1.054792 -0.946980 -0.101034 -1.978840
2  0.373354 -0.054479  1.730031  0.126603
3 -0.003914 -0.197458 -0.173473 -0.517045
4  1.210433 -0.034517 -1.253563  0.605233

In [28]:
pd.DataFrame(np.random.randn(5,4),index='A B C D E '.split(),columns='W X Y Z'.split())

          W         X         Y         Z
A  0.289561 -0.158632 -0.247356  0.848569
B -1.561846  0.670200  2.391375 -0.451892
C -1.829935 -0.792093 -0.224598 -0.910907
D  0.729926 -1.695588 -0.918544 -0.864570
E  0.923042  0.000480 -0.103494  0.356677

In [29]:
pd.DataFrame(np.random.randint(0,10,(5,4)),index='v w x y z'.split(),columns='p q r s'.split())

   p  q  r  s
v  3  1  6  8
w  9  6  9  6
x  9  3  5  7
y  4  1  0  0
z  2  9  7  7

In [33]:
a1=pd.DataFrame(np.random.randint(0,10,(5,4)),index='v w x y z'.split(),columns='p q r s'.split())
a1['r']

v    4
w    7
x    0
y    9
z    6
Name: r, dtype: int32

In [35]:
a1[['p','q']]

   p  q
v  6  9
w  7  2
x  4  2
y  9  8
z  2  2

In [37]:
a1

   p  q  r  s
v  6  9  4  8
w  7  2  7  7
x  4  2  0  4
y  9  8  9  0
z  2  2  6  7

In [38]:
a1['New']=a1['p']+a1['q']

In [39]:
a1['New']

v    15
w     9
x     6
y    17
z     4
Name: New, dtype: int32

In [40]:
a1

   p  q  r  s  New
v  6  9  4  8   15
w  7  2  7  7    9
x  4  2  0  4    6
y  9  8  9  0   17
z  2  2  6  7    4

In [41]:
a1.drop('New',axis=1)

   p  q  r  s
v  6  9  4  8
w  7  2  7  7
x  4  2  0  4
y  9  8  9  0
z  2  2  6  7

In [42]:
a1

   p  q  r  s  New
v  6  9  4  8   15
w  7  2  7  7    9
x  4  2  0  4    6
y  9  8  9  0   17
z  2  2  6  7    4

In [43]:
a1.drop('New',axis=1,inplace=True)

In [44]:
a1

   p  q  r  s
v  6  9  4  8
w  7  2  7  7
x  4  2  0  4
y  9  8  9  0
z  2  2  6  7

In [45]:
a2=pd.DataFrame(np.random.randn(5,4),index='A B C D E '.split(),columns='W X Y Z'.split())
a2['U']=a2['Y']+a2['W']
a2['U']

A   -0.072382
B   -0.800764
C   -0.170189
D   -1.216591
E   -3.764762
Name: U, dtype: float64

In [46]:
a2

          W         X         Y         Z         U
A -0.020610  0.431534 -0.051771  0.657891 -0.072382
B  0.574934  0.200478 -1.375698  0.184152 -0.800764
C -0.408880  0.793550  0.238691  0.062650 -0.170189
D -0.245458  0.178105 -0.971133 -1.132940 -1.216591
E -1.213511  0.871352 -2.551251  1.977056 -3.764762

In [47]:
a2.drop('X',axis=1,inplace=True)
a2

          W         Y         Z         U
A -0.020610 -0.051771  0.657891 -0.072382
B  0.574934 -1.375698  0.184152 -0.800764
C -0.408880  0.238691  0.062650 -0.170189
D -0.245458 -0.971133 -1.132940 -1.216591
E -1.213511 -2.551251  1.977056 -3.764762

In [48]:
a2.loc['A']

W   -0.020610
Y   -0.051771
Z    0.657891
U   -0.072382
Name: A, dtype: float64

In [49]:
a2.iloc[4]

W   -1.213511
Y   -2.551251
Z    1.977056
U   -3.764762
Name: E, dtype: float64

In [50]:
a2.loc['F']=a2.loc['A']+a2.loc['E']

In [51]:
a2

          W         Y         Z         U
A -0.020610 -0.051771  0.657891 -0.072382
B  0.574934 -1.375698  0.184152 -0.800764
C -0.408880  0.238691  0.062650 -0.170189
D -0.245458 -0.971133 -1.132940 -1.216591
E -1.213511 -2.551251  1.977056 -3.764762
F -1.234121 -2.603022  2.634947 -3.837143

In [52]:
a2.drop(['A'],inplace=True)

In [53]:
a2

          W         Y         Z         U
B  0.574934 -1.375698  0.184152 -0.800764
C -0.408880  0.238691  0.062650 -0.170189
D -0.245458 -0.971133 -1.132940 -1.216591
E -1.213511 -2.551251  1.977056 -3.764762
F -1.234121 -2.603022  2.634947 -3.837143

In [55]:
a2.loc[['B','D','F'],['Z','U']]

          Z         U
B  0.184152 -0.800764
D -1.132940 -1.216591
F  2.634947 -3.837143

In [56]:
a2>0

       W      Y      Z      U
B   True  False   True  False
C  False   True   True  False
D  False  False  False  False
E  False  False   True  False
F  False  False   True  False

In [57]:
a2[a2>0]

          W         Y         Z   U
B  0.574934       NaN  0.184152 NaN
C       NaN  0.238691  0.062650 NaN
D       NaN       NaN       NaN NaN
E       NaN       NaN  1.977056 NaN
F       NaN       NaN  2.634947 NaN

In [58]:
a2[a2<0]

          W         Y        Z         U
B       NaN -1.375698      NaN -0.800764
C -0.408880       NaN      NaN -0.170189
D -0.245458 -0.971133 -1.13294 -1.216591
E -1.213511 -2.551251      NaN -3.764762
F -1.234121 -2.603022      NaN -3.837143

In [59]:
a2[a2>0].dropna()

Empty DataFrame
Columns: [W, Y, Z, U]
Index: []

In [60]:
a2

          W         Y         Z         U
B  0.574934 -1.375698  0.184152 -0.800764
C -0.408880  0.238691  0.062650 -0.170189
D -0.245458 -0.971133 -1.132940 -1.216591
E -1.213511 -2.551251  1.977056 -3.764762
F -1.234121 -2.603022  2.634947 -3.837143

In [62]:
a2[a2['W']>0]

          W         Y         Z         U
B  0.574934 -1.375698  0.184152 -0.800764

In [63]:
a2[a2['Z']<0]

          W         Y        Z         U
D -0.245458 -0.971133 -1.13294 -1.216591

In [2]:
a2=pd.DataFrame(np.random.randn(5,4),index='A B C D E '.split(),columns='W X Y Z'.split())
a2[(a2['W']>0) & (a2['Z']<0)]

          W         X         Y         Z
A  1.612533  1.004675  1.441888 -0.066243
D  1.338680 -0.060768  0.730513 -0.242349

In [4]:
a2[(a2['W']>0) | (a2['Z']<0)]

          W         X         Y         Z
A  1.612533  1.004675  1.441888 -0.066243
B  0.571711  0.146999  0.397911  0.122204
C -1.047292  0.097425  1.702798 -0.117107
D  1.338680 -0.060768  0.730513 -0.242349
E  0.009456  0.725345  0.909513  0.315983

In [5]:
a2

          W         X         Y         Z
A  1.612533  1.004675  1.441888 -0.066243
B  0.571711  0.146999  0.397911  0.122204
C -1.047292  0.097425  1.702798 -0.117107
D  1.338680 -0.060768  0.730513 -0.242349
E  0.009456  0.725345  0.909513  0.315983

In [6]:
a2.reset_index()

  index         W         X         Y         Z
0     A  1.612533  1.004675  1.441888 -0.066243
1     B  0.571711  0.146999  0.397911  0.122204
2     C -1.047292  0.097425  1.702798 -0.117107
3     D  1.338680 -0.060768  0.730513 -0.242349
4     E  0.009456  0.725345  0.909513  0.315983

In [7]:
a2['states']=['1','2','3','4','5']

In [8]:
a2.set_index('states')

               W         X         Y         Z
states
1       1.612533  1.004675  1.441888 -0.066243
2       0.571711  0.146999  0.397911  0.122204
3      -1.047292  0.097425  1.702798 -0.117107
4       1.338680 -0.060768  0.730513 -0.242349
5       0.009456  0.725345  0.909513  0.315983

MULTI HIIERCHICAL INDEXES

In [6]:
outside=['g1','g1','g1','g2','g2','g2','g2']
inside=['a','b','c','a','b','c']
ind=list(zip(outside,inside))
ind=pd.MultiIndex.from_tuples(ind)
ind

MultiIndex([('g1', 'a'),
            ('g1', 'b'),
            ('g1', 'c'),
            ('g2', 'a'),
            ('g2', 'b'),
            ('g2', 'c')],
           )

In [7]:
df=pd.DataFrame(np.random.randint(0,10,(6,5)),index=ind,columns='A B C D E'.split())
df

      A  B  C  D  E
g1 a  6  1  8  0  5
   b  3  6  7  3  0
   c  4  1  5  7  6
g2 a  6  9  5  5  9
   b  2  9  6  7  9
   c  3  8  0  4  5

In [9]:
df.loc['g1'].loc['a']

A    6
B    1
C    8
D    0
E    5
Name: a, dtype: int32

In [10]:
df.xs(['g1','a'])

C:\Users\KIIT\AppData\Local\Temp\ipykernel_17600\3083662670.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['g1','a'])

A    6
B    1
C    8
D    0
E    5
Name: (g1, a), dtype: int32

In [15]:
df.index.names = ['Group','Num']
df

           A  B  C  D  E
Group Num
g1    a    6  1  8  0  5
      b    3  6  7  3  0
      c    4  1  5  7  6
g2    a    6  9  5  5  9
      b    2  9  6  7  9
      c    3  8  0  4  5

In [20]:
df.xs('a',level='Num')

       A  B  C  D  E
Group
g1     6  1  8  0  5
g2     6  9  5  5  9

In [21]:
d={'A':[1,2,np.nan],'B':[1,np.nan,np.nan],'C':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [1, nan, nan], 'C': [1, 2, 3]}

In [22]:
df=pd.DataFrame(d,['X','Y','Z'])
df

     A    B  C
X  1.0  1.0  1
Y  2.0  NaN  2
Z  NaN  NaN  3

In [23]:
df.dropna()

     A    B  C
X  1.0  1.0  1

In [24]:
df.dropna(axis=1)

   C
X  1
Y  2
Z  3

In [26]:
df.dropna(thresh=2)

     A    B  C
X  1.0  1.0  1
Y  2.0  NaN  2

In [27]:
df.dropna(axis=1,thresh=2)

     A  C
X  1.0  1
Y  2.0  2
Z  NaN  3

In [29]:
df.fillna(value=0)

     A    B  C
X  1.0  1.0  1
Y  2.0  0.0  2
Z  0.0  0.0  3

In [30]:
df.fillna(value=df.mean())

     A    B  C
X  1.0  1.0  1
Y  2.0  1.0  2
Z  1.5  1.0  3

In [31]:
df =  pd.read_csv('example')

In [32]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [33]:
f=open('example')
f.readlines()

['a,b,c,d\n', '0,1,2,3\n', '4,5,6,7\n', '8,9,10,11\n', '12,13,14,15\n']

In [34]:
f.close()

In [37]:
df.to_csv('test',index=False)#read to csv file

In [3]:
df=pd.DataFrame(np.random.randint(0,5,(10,10)),index=[0,1,2,3,4,5,6,7,8,9],columns='A B C D E F G H I J '.split())
df

   A  B  C  D  E  F  G  H  I  J
0  2  4  1  1  0  3  2  4  0  4
1  3  0  4  1  3  0  2  4  4  1
2  4  0  3  1  2  3  3  4  3  0
3  4  1  2  1  1  4  4  0  3  4
4  4  0  2  1  1  0  3  0  0  1
5  0  2  1  4  3  0  4  4  1  0
6  1  1  2  4  0  2  4  0  0  4
7  3  1  4  1  0  2  4  4  0  3
8  3  0  2  0  1  2  0  1  1  2
9  3  4  3  4  4  4  3  0  2  0

In [4]:
df.head()

   A  B  C  D  E  F  G  H  I  J
0  2  4  1  1  0  3  2  4  0  4
1  3  0  4  1  3  0  2  4  4  1
2  4  0  3  1  2  3  3  4  3  0
3  4  1  2  1  1  4  4  0  3  4
4  4  0  2  1  1  0  3  0  0  1

In [5]:
df.head(2)

   A  B  C  D  E  F  G  H  I  J
0  2  4  1  1  0  3  2  4  0  4
1  3  0  4  1  3  0  2  4  4  1

In [6]:
df.tail()

   A  B  C  D  E  F  G  H  I  J
5  0  2  1  4  3  0  4  4  1  0
6  1  1  2  4  0  2  4  0  0  4
7  3  1  4  1  0  2  4  4  0  3
8  3  0  2  0  1  2  0  1  1  2
9  3  4  3  4  4  4  3  0  2  0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 0 to 9
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     int32
 1   B       10 non-null     int32
 2   C       10 non-null     int32
 3   D       10 non-null     int32
 4   E       10 non-null     int32
 5   F       10 non-null     int32
 6   G       10 non-null     int32
 7   H       10 non-null     int32
 8   I       10 non-null     int32
 9   J       10 non-null     int32
dtypes: int32(10)
memory usage: 480.0 bytes

In [8]:
df.describe()

,A,B,C,D,E,F,G,H,I,J
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.00000
mean,2.700000,1.300000,2.400000,1.800000,1.500000,2.000000,2.900000,2.100000,1.400000,1.90000
std,1.337494,1.567021,1.074968,1.549193,1.433721,1.563472,1.286684,2.024846,1.505545,1.72884
min,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000
25%,2.250000,0.000000,2.000000,1.000000,0.250000,0.500000,2.250000,0.000000,0.000000,0.25000
50%,3.000000,1.000000,2.000000,1.000000,1.000000,2.000000,3.000000,2.500000,1.000000,1.50000
75%,3.750000,1.750000,3.000000,3.250000,2.750000,3.000000,4.000000,4.000000,2.750000,3.75000
max,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.00000

In [9]:
df['A'].unique()

array([2, 3, 4, 0, 1])

In [10]:
df['A'].nunique()

5

In [11]:
 df['A'].value_counts()

3    4
4    3
2    1
0    1
1    1
Name: A, dtype: int64